public class DrawCard {
}

/**
 * DrawImage -> 이미지 객체를 가지고 해당하는 이미지를 그려봄
 * 원하는 크기로 이미지를 줄이기.
 *  이미지는 프로젝트와 같은 폴더 안에 들어있어야 함.
 *
 *  DrawLine 실습: 선들 여러개 그리는거. 임의로 주는게 아니라 반복문 안에서
 *  drawline 하기. 프레임의 크기가 변화하면 거기에 맞춰서 줄었다 늘렸다 할 수 있게 하라.
 *  x 좌표를 값만큼 옮기면 됨. 반복문 안에서 코드 작성하는게 핵심
 *
 *  마름모
 *  선 그리기
 *
 *  도형 그리기 및 칠하기
 *  막대그랲(fillRect), 파이차트(fillArc) . 별(fillPolyGon)  등  하나하나를 각각의 팬널로 두고, 패널 3개를 정의하고 3개를 전체 프레임에다가
 *  gridlayout 으로 등록하기.
 *
 *  마우스로 원 그리기
 *  마우쓰를 찍은 그 위치를 원의 중심으로 하고, 드래깅하여 찍으면 반지름으로 하게끔 해라.
 *
 *  신호등예제:
 *  누를때마다 위치가 바뀌면

 */